##### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

##### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
list1 = [4,13,531,"muskan","datascience","pwskills"]
series2 = pd.Series(list1)
print(series2)
print(type(series2))

0              4
1             13
2            531
3         muskan
4    datascience
5       pwskills
dtype: object
<class 'pandas.core.series.Series'>

##### Q3. Create a Pandas DataFrame that contains the following data: ........  , Then, print the DataFrame.

In [4]:
data = {"Name":["Alice","Bob","Claire"],
       "Age":[25,30,27],
       "Gender":["Female","Male","Female"]}
df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

##### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A Series is a one-dimensional array holding data of any type. It is a type of list in Pandas that can 
have labels as keys. A series is also the data structure for a single column of a DataFrame.

A DataFrame is a collection of series that share the same index. It is a two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). In a DataFrame, each column of data is represented as a pandas Series.

In [5]:
#Using previous example to show the difference
pd.Series(data)

Name        [Alice, Bob, Claire]
Age                 [25, 30, 27]
Gender    [Female, Male, Female]
dtype: object

In [6]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

##### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Here are some common functions we can use to manipulate the pandas dataframe:

head(): This function is used to return the first n rows of the DataFrame. By default, it returns the first 5 rows.

tail(): This function is used to return the last n rows of the DataFrame. By default, it returns the last 5 rows.

describe(): This function is used to generate descriptive statistics of the DataFrame.

drop(): This function is used to remove rows or columns from the DataFrame.

sort_values(): This function is used to sort the DataFrame by one or more columns.

groupby(): This function is used to group the DataFrame by one or more columns.

pivot_table(): This function is used to create a spreadsheet-style pivot table as a DataFrame.

In [7]:
### using previous dataframe 
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [8]:
grouped = df.groupby("Gender")['Age'].median()
grouped

Gender
Female    26.0
Male      30.0
Name: Age, dtype: float64

In [9]:
#if we want to sort values according to age in ascending/descending we can do by using sort function
df.sort_values("Age")

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

##### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans - All Pandas data structures are value mutable (can be changed) and except Series all are size mutable. Series is size immutable

##### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [10]:
## creating multiple series using pandas.Series
s1 = pd.Series(["Muskan","Shreya","Anmol","Ashish","lovy"])
s2 = pd.Series([23,23,26,27,24])
s3 = pd.Series(["Female","Female","Male","Male","Male"])

print(s1,s2,s3)

0    Muskan
1    Shreya
2     Anmol
3    Ashish
4      lovy
dtype: object 0    23
1    23
2    26
3    27
4    24
dtype: int64 0    Female
1    Female
2      Male
3      Male
4      Male
dtype: object

In [11]:
# using pandas series to create a dataframe
df1 = pd.DataFrame({"Name":s1 , "Age":s2 ,"Gender":s3})
df1

     Name  Age  Gender
0  Muskan   23  Female
1  Shreya   23  Female
2   Anmol   26    Male
3  Ashish   27    Male
4    lovy   24    Male